
let obj = {
  'name': '王乾元',
  'mse': '0.1',
  'mae': '0.2',
  'r2': '0.3',
  'mse': '0.4',
  'trainCost': '0.5',
  'trainRows': '0.6',
}
/*
* 期望将obj变成如下
* let obj = {
    '模型名称': '王乾元',
    '均方误差': '0.1',
    '平均绝对误差': '0.2',
    '决定系数': '0.2=3',
    '均方误差': '0.4',
    '数据集': '0.5',
    '数据集': '0.6',
  }
* */

// 1.先建立中英文映射关系
let changeObj = {
  'name': '模型名称',
  'mse': '均方误差',
  'mae': '平均绝对误差',
  'r2': '决定系数',
  'mse': '均方误差',
  'trainCost': '训练时长',
  'trainRows': '数据集',
}
//2.使用for...in处理obj对象
for (let key in obj){
  obj[changeObj[key]] = obj[key]
  delete obj[key]
}


console.log(obj);
/*
* 输出结果obj= {
  '模型名称': '王乾元',
  '均方误差': '0.4',
  '平均绝对误差': '0.2',
  '决定系数': '0.3',
  '训练时长': '0.5',
  '数据集': '0.6' }
* */